ХамелионЦРПТ/src/InformationRegisters/ХН_СоотвествиеФайловВводуВОборот/ХН_СоотвествиеФайловВводуВОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХН_СоотвествиеФайловВводуВОборот</name>
  <resources>
    <name>КоличествоКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Файл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>GTIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПартии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВводВОборот</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/InformationRegisters/ХН_СоотвествиеФайловВводуВОборот/ManagerModule.bsl
// Возвращает данные о транспортной операции по номеру и виду ТТН.
//
// Параметры:
//	НомерТТН - Строка(12) - Номер ТТН
//	ВидТТН - Перечисление.ФТО_ВидыТТН - Вид ТТН.
//
// Возвращаемое значение:
//  Массив - массив, содержащий транспортные операции.
//
Функция ВводВОборотПоДаннымФайла(СтукрутаОтбора, МассивИсключений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МВ_СоотвествиеФайловВводуВОборот.ВводВОборот КАК ВводВОборот
		|ИЗ
		|	РегистрСведений.ХН_СоотвествиеФайловВводуВОборот КАК МВ_СоотвествиеФайловВводуВОборот
		|ГДЕ
		|	МВ_СоотвествиеФайловВводуВОборот.GTIN = &GTIN
		|	И МВ_СоотвествиеФайловВводуВОборот.НомерПартии = &НомерПартии
		|	И МВ_СоотвествиеФайловВводуВОборот.ДатаПроизводства = &ДатаПроизводства
		|	И НЕ МВ_СоотвествиеФайловВводуВОборот.ВводВОборот В (&МассивИсключений)";
	
	Запрос.УстановитьПараметр("МассивИсключений", МассивИсключений);
	Запрос.УстановитьПараметр("GTIN", СтукрутаОтбора.GTIN);
		Запрос.УстановитьПараметр("НомерПартии", СтукрутаОтбора.НомерПартии);
	Запрос.УстановитьПараметр("ДатаПроизводства", СтукрутаОтбора.ДатаПроизводства);

	РезультатЗапроса = Запрос.Выполнить();	
	ВводВОборот = РезультатЗапроса.Выгрузить();  
	
	Возврат ВводВОборот.ВыгрузитьКолонку("ВводВОборот");;
	
КонецФункции
